<img src="SQLite_logo.png" width="500" height="300" align="right"/>

# SQL: Update

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
to_server = r'.\My_Customer_Warehouse.db'
conn = sql.connect(to_server)
c = conn.cursor()

## Update table using execute method

In [3]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
c.fetchall()

[('agents',),
 ('company',),
 ('customer',),
 ('orders',),
 ('daysorder',),
 ('despatch',),
 ('foods',),
 ('listofitem',),
 ('student',),
 ('studentreport',),
 ('customer_analytics',),
 ('Income_Expense_Data',),
 ('online_shoppers_intention',)]

In [4]:
result = pd.read_sql('select * from orders', conn)
result.head()

,ORD_NUM,ORD_AMOUNT,ADVANCE_AMOUNT,ORD_DATE,CUST_CODE,AGENT_CODE,ORD_DESCRIPTION
0,200100,1000,600,2008-01-08,C00015,A003,SOD\r
1,200110,3000,500,2008-04-15,C00019,A010,SOD\r
2,200107,4500,900,2008-08-30,C00007,A010,SOD\r
3,200112,2000,400,2008-05-30,C00016,A007,SOD\r
4,200113,4000,600,2008-06-10,C00022,A002,SOD\r

### Queries

In [5]:
alter = ["ALTER TABLE despatch RENAME TO deliveries", 
        'alter table student add column AGE']

update=['UPDATE orders SET ORD_AMOUNT = 3001 WHERE ORD_NUM = 200110']

In [6]:
c.execute(alter[0])

In [7]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
c.fetchall()

[('agents',),
 ('company',),
 ('customer',),
 ('orders',),
 ('daysorder',),
 ('deliveries',),
 ('foods',),
 ('listofitem',),
 ('student',),
 ('studentreport',),
 ('customer_analytics',),
 ('Income_Expense_Data',),
 ('online_shoppers_intention',)]

In [8]:
c.execute(alter[1])

In [9]:
result = pd.read_sql('select * from student', conn)
result.head()

,NAME,TITLE,CLASS,SECTION,ROLLID,AGE
0,Deepak,Saxana,V,A,15,None
1,Robert,Paul,VI,A,2,None
2,Danny,Moris,V,B,15,None

In [10]:
c.execute(update[0])

In [11]:
result = pd.read_sql('select * from orders', conn)
result.head()

,ORD_NUM,ORD_AMOUNT,ADVANCE_AMOUNT,ORD_DATE,CUST_CODE,AGENT_CODE,ORD_DESCRIPTION
0,200100,1000,600,2008-01-08,C00015,A003,SOD\r
1,200110,3001,500,2008-04-15,C00019,A010,SOD\r
2,200107,4500,900,2008-08-30,C00007,A010,SOD\r
3,200112,2000,400,2008-05-30,C00016,A007,SOD\r
4,200113,4000,600,2008-06-10,C00022,A002,SOD\r

## Update table using pandas

In [12]:
df_orders = pd.read_sql('select * from orders', conn)
df_orders['diff'] = df_orders['ORD_AMOUNT']- df_orders['ADVANCE_AMOUNT']

In [13]:
df_orders.to_sql('orders', con=conn, if_exists='replace')

In [14]:
result = pd.read_sql('select * from orders', conn)
result.head()

,index,ORD_NUM,ORD_AMOUNT,ADVANCE_AMOUNT,ORD_DATE,CUST_CODE,AGENT_CODE,ORD_DESCRIPTION,diff
0,0,200100,1000,600,2008-01-08,C00015,A003,SOD\r,400
1,1,200110,3001,500,2008-04-15,C00019,A010,SOD\r,2501
2,2,200107,4500,900,2008-08-30,C00007,A010,SOD\r,3600
3,3,200112,2000,400,2008-05-30,C00016,A007,SOD\r,1600
4,4,200113,4000,600,2008-06-10,C00022,A002,SOD\r,3400

In [15]:
conn.commit()
conn.close()